In [41]:
import pandas as pd

# Define data as a dictionary
data = {
    'name': ['a', 'b', 'c', 'd', 'e', 'f'],  # List of names
    'income': [100000, 85000, 90000, 75000, 80000, 1000000]  # List of income values
}

# Create a DataFrame 'df' using the defined data
df = pd.DataFrame(data)

  name   income
0    a   100000
1    b    85000
2    c    90000
3    d    75000
4    e    80000
5    f  1000000

In [43]:

# Calculate mean of 'income' column
mean_income = df['income'].mean()

# Print the mean income
mean_income

238333.33333333334

In [45]:
df['income'][2]=np.NaN
df

C:\Users\DELL\AppData\Local\Temp\ipykernel_7468\238163948.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][2]=np.NaN
C:\Users\DELL\AppData\Local\Temp\ipykernel_7468\238163948.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][2]=np.NaN

  name     income
0    a   100000.0
1    b    85000.0
2    c        NaN
3    d    75000.0
4    e    80000.0
5    f  1000000.0

In [47]:
# Fill missing values (NaN) in 'income' column with the mean of non-null values
newdf = df.fillna(df['income'].mean())
newdf
# mean cannot be used as average here. Because the data frame have outlier 1000000.

  name     income
0    a   100000.0
1    b    85000.0
2    c   268000.0
3    d    75000.0
4    e    80000.0
5    f  1000000.0

In [49]:
# Fill missing values (NaN) in 'income' column with the median of non-null values
newdf=df.fillna(df.income.median())
newdf
# median is suitable for average, because it is less sensitive to outlier.

  name     income
0    a   100000.0
1    b    85000.0
2    c    85000.0
3    d    75000.0
4    e    80000.0
5    f  1000000.0